{
    "Shader": {
        "info": {
            "date": "1593221296",
            "description": "As a tribute to Victor Vasarely, a challenge to myself, and one of these urges, I wanted to recreate some works of Vasarel. I posted some of these recreations on my Instagram, feel free to check it out: @ciphrd\nSee top of shader for details on this work",
            "flags": 0,
            "hasliked": 0,
            "id": "3tXcWf",
            "likes": 8,
            "name": "Generative Vasarely - Cinétique",
            "published": 3,
            "tags": [
                "moire",
                "recreation",
                "vasarely",
                "cinetic"
            ],
            "usePreview": 0,
            "username": "ciphered",
            "viewed": 438
        },
        "renderpass": [
            {
                "code": "// \n// Beta 1958 - 1964, is a work by Victor Vasarely\n// I found the existence of this piece in the book Vasarely, Magdalena Holzhey, p.10)\n// However, there is little to no existence of this work that can be found online (at\n// least from my research). I could only find some colored version on bidding websites,\n// so I don't know about the authenticity of these pieces. While researching, I found\n// a version I liked:\n// https://www.amorosart.com/oeuvre-vasarely-objet_cin%C3%A9tique-71325.html\n//\n// It is labbeled \"Objet Cinétique\", and unfortunatly a lot of different pieces related \n// to Vasarely labelled \"Objet Cinétique\" can be found online. It is possible that this \n// version was from him, and likely that it was some recreation of his work Beta (this\n// is a guess from me, I haven't verified this information).\n//\n// Vasarely wanted his work to be similar as music sheets,\n// interpretable by anyone as they liked. He really wanted art to be more accessible,\n// regardless of their background. I thought that recreating this particular version,\n// that I liked more than his original work Beta, could be a great tribute to both \n// Beta and Vasarely's ideology.\n//\n// About the piece: since I diverged so much from the original work, I decided to try\n// my best at recreating an accurate version of \"Objet Cinétique\".\n//\n//\n// HOW TO LOOK AT THE PIECE\n//\n// This piece was made to be watched in full screen, by staring at the center for the\n// whole duration of the animation. Due to how vision gets tricked in seeing a slow\n// an continuous motion towards the center, the brain starts to have issues processing \n// the high contrast between the bands, and starts will feel incomfortable keeping the\n// focus at the center. After 55s, once the motion stops, the piece reaches its final\n// state, close to the version I tried to recreate. If the focus was kept at the center\n// the work will seem to glitter because the brain still thinks there is motion and is\n// lost by this static state. Bands becomes unstable. A weird feeling emerge when the\n// brain realizes that nothing moves anymore, but the glitter will never trully stops.\n// If you slightly look arround the center, the \"disk\" will appear to be rotating.\n//\n// Special Thanks to @FabriceNeyret2 for the time he took to review and optimize this\n// shader. This version was re-written with his precious advice.\n//\n\n\n\n#define C_WIDTH_MIN .05\n#define C_WIDTH_MAX .018\n#define L_SMOOTH .15\n#define PI 3.1415926\n\n#define rot(a)   mat2( cos(a), -sin(a), sin(a), cos(a) )\n#define rand(n)  fract(sin(dot(n, vec2(12.9898, 4.1414))) * 43758.5453)\n\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n    \n    vec2 uv = (fragCoord - .5*iResolution.xy)  / iResolution.y;\n    \n    // piece is designed for 55s, t € [0;1]\n    float t = min(1., iTime / 55.0);\n    \n    \n    // space is divided into circles\n   \tfloat cwidth = mix(C_WIDTH_MIN, C_WIDTH_MAX, t);\n    float dc = length(uv) / cwidth;\n    \n    // circle division\n    float circ = abs(fract(dc) - .5);\n    \n    // the square\n    vec2 v = smoothstep(0.27, 0.23, abs(uv) * rot(t * PI * 4.));\n    float rect = pow(v.x* v.y, 10.);\n    \n    // the width of the circle line\n    float width = 0.15 + 0.11 * rect;\n    // we add some variation to it\n    float ang = atan(uv.y, uv.x);\n    float id = floor(dc);\n    width+= cos(-id * .2 + ang*2. + t * 15.) * .05 + .05;\n    \n    // to match with our model, only 20 circles are visible\n    if (dc > 21.) width = .3;\n\n    \n    // this isn't antialiasing, this was made to create moiré patterns, amplifying the illution of a motion \n    // having a constant value to smoothen is what makes the moiré works at any resolution, from my observations\n    float c = smoothstep(width, width - L_SMOOTH, circ);\n    \n    // we cut outer ring\n    c*= step(dc, 22.);\n    \n    // we cut a square out of this, and create a border arround it\n    v = step(abs(uv), vec2(.4));\n    float inside = v.x * v.y;\n    v = step(abs(uv), vec2(.42));\n    float border = v.x * v.y;\n    c*= inside;\n    c+= 1.0 - border;\n    c+= .15 * rand(uv);\n    \n    // the background\n    c*= clamp(pow(max(0., (1.-length(uv))), .2)* 1.1, .2, 1.);\n\n    // Output to screen\n    fragColor = c * vec4(1., 1., 0.92, 1.);\n}",
                "description": "",
                "inputs": [],
                "name": "Image",
                "outputs": [
                    {
                        "channel": 0,
                        "id": 37
                    }
                ],
                "type": "image"
            }
        ],
        "ver": "0.1"
    }
}