{
    "Shader": {
        "info": {
            "date": "1504764022",
            "description": "Yeat another hash experiment. Most of the 32 bits come out very good, but really we only need the top 24 to be good in order to get a good floating-point value in [0..1]",
            "flags": 0,
            "hasliked": 0,
            "id": "4tXyWN",
            "likes": 50,
            "name": "Integer Hash21",
            "published": 3,
            "tags": [
                "2d",
                "hash"
            ],
            "usePreview": 0,
            "username": "iq",
            "viewed": 5333
        },
        "renderpass": [
            {
                "code": "// The MIT License\n// Copyright © 2017,2024 Inigo Quilez\n// Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\n// Untested for uniformity, stratification or periodicity. I\n// obviously eyeballed the funny constants; I could automate\n// a search and find constants that produce a better quality\n// hash. Needless to say these are joke-hashes, please don't\n// use these in real projects.\n//\n// See these too: \n//\n// - https://www.shadertoy.com/view/llGSzw\n// - https://www.shadertoy.com/view/XlXcW4\n// - https://www.shadertoy.com/view/4tXyWN\n\nuint hash21( uvec2 p )\n{\n    p *= uvec2(73333,7777);\n    p ^= (uvec2(3333777777)>>(p>>28));\n    uint n = p.x*p.y;\n    return n^(n>>15);\n}\n\nfloat hash( uvec2 p )\n{\n    // we only need the top 24 bits to be good really\n    uint h = hash21( p );\n\n    // straight to float, see https://iquilezles.org/articles/sfrand/\n    // return uintBitsToFloat((h>>9)|0x3f800000u)-1.0;\n    \n    return float(h)*(1.0/float(0xffffffffU));\n}\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n    uvec2 p = uvec2(fragCoord) + 1920U*1080U*uint(iFrame);\n    \n    float f = hash(p);\n    \n    fragColor = vec4( f, f, f, 1.0 );\n}",
                "description": "",
                "inputs": [],
                "name": "Image",
                "outputs": [
                    {
                        "channel": 0,
                        "id": 37
                    }
                ],
                "type": "image"
            }
        ],
        "ver": "0.1"
    }
}