{
    "Shader": {
        "info": {
            "date": "1646342276",
            "description": "sRGB is [b]NOT[/b] the same thing as 2.2 gamma !  The error is significant for images with dark tones.\n\nIf top half of image appears consistent: colors are displayed by sRGB piecewise.\nIf bottom half consistent: displayed by gamma=2.2 power function.",
            "flags": 0,
            "hasliked": 0,
            "id": "7sjBWD",
            "likes": 5,
            "name": "sRGB vs gamma encoding 2",
            "published": 3,
            "tags": [
                "gamma",
                "srgb",
                "srgbvspow"
            ],
            "usePreview": 0,
            "username": "ttg",
            "viewed": 3075
        },
        "renderpass": [
            {
                "code": "/*\nPlease read full description here:\n\nsRGB encoding is *NOT* the same thing as 2.2 gamma !\nThe error is significant for images with dark tones.\n\nYes, the image should be that dark.\nTry dark theme or fullscreen if you have trouble seeing it.\n\nIf you see any moire patterns, you are on mobile or Mac, or have a calibration\nproblem or screen scaling setting, and the test cannot be used.\n\nIf the top two strips appear consistent in intensity:\n  Canvas colors are being displayed according to sRGB piecewise function.\nIf bottom two appear consistent in intensity:\n  Canvas colors are being displayed according to sRGB simple power function.\n\nExplanation:\n\nThe image is divided into four strips.\nEach represents the same red-green linear gradient.\n\nThe inner two drop into the linear portion of sRGB luminosity encoding curve.\nThe outer two avoid this portion by using a higher value range with halftone\npattern.\n\nThe top half of the image is output with sRGB luminosity encoding.\nThe bottom half is output with gamma 2.2 response encoding.\n\nThe extreme darkness of the image is as intended, the error in difference of\nthese encodings becomes significant in this range.\nBanding is expected and does not make the comparison invalid.\n\nThe mismatch can be a problem for any standard dynamic range imagery using the\nfull dynamic luminosity range: the distortion to dark colors and values is\nsimilar to that of inappropriate gamma corrections for bright images: At the\nbottom of the range, the gamma of sRGB encoding is NOT 2.2, it is exactly 1.0 !\n\n*/\n\nvec3 srgb_encode (vec3 v) {\n  return mix(12.92*v,1.055*pow(v,vec3(.41666))-.055,lessThan(vec3(.0031308),v));\n}\n\nvoid mainImage (out vec4 d, vec2 f) {\n#define HALFTONE(p) float(int(dot(floor(f),vec2(413,229)))%512<int((p)*512.))\n  vec2 uv = f/iResolution.xy;\n  vec3 col = mix(vec3(1,0,0),vec3(0,1,0),uv.x);\n  col*=.005;\n  if (abs(uv.y*2.-1.)>.5) {\n    col*=3.*HALFTONE(1./3.);\n  }\n  if (uv.y>.5) d.rgb = srgb_encode(col);\n  else         d.rgb = pow(col,vec3(1./2.2));\n}",
                "description": "",
                "inputs": [],
                "name": "Image",
                "outputs": [
                    {
                        "channel": 0,
                        "id": 37
                    }
                ],
                "type": "image"
            }
        ],
        "ver": "0.1"
    }
}