{
    "Shader": {
        "info": {
            "date": "1726762701",
            "description": "input:\nwrite a shader for shadertoy that displays a wireframe 3d cube looked at from an 45 angle above and that is rotating slowly around its vertical axis\n",
            "flags": 0,
            "hasliked": 0,
            "id": "l3fyWl",
            "likes": 0,
            "name": "gpt task",
            "published": 3,
            "tags": [
                "gpt"
            ],
            "usePreview": 0,
            "username": "kon",
            "viewed": 74
        },
        "renderpass": [
            {
                "code": "/*\n\ninput:\nwrite a shader for shadertoy that displays a wireframe 3d cube looked at from an 45 angle above and that is rotating slowly around its vertical axis\n\n\nThought for 93 seconds\n\nCrafting the shader\n\nSetting up a GLSL fragment shader to render a rotating wireframe 3D cube, viewed from a 45-degree angle, considering Shadertoy's execution constraints. This approach will ensure the shader operates effectively within the platform's capabilities.\n\nRendering wireframe cubes\n\nI'm exploring options for rendering wireframe cubes using raymarching. One approach is defining cube edges as thickened lines or cylinders and using distance functions to render pixels near these edges.\n\nIdentifying cube edges\n\nI’m setting up 12 cube edges by pinpointing connections between eight vertices, each at (±1, ±1, ±1), and mapping connections to their rear and front counterparts.\n\nWeighing distance measures\n\nI’m mapping out various ways to calculate the shortest distance to an edge of a cube, including ray marching and transforming the cube into ray space.\n\nDefining cube edges\n\nI’m exploring how to compute the minimal distance from a point to the edges of a cube, considering infinite lines or 12 cylinders centered along the cube's edges.\n\nFormalizing distance\n\nI’m outlining a distance function for calculating distances to a partially capped cylinder, though it appears intricate. This function might be optimized for performance but seems overly complex.\n\nMapping distance\n\nI’m thinking through a simpler function to compute the distance to a capped cylinder. This could streamline the process by focusing on the nearest edge.\n\nCalculating minimal distance\n\nI’m defining a function to find the minimal distance from a point to a line segment, aiming to determine when a ray intersects the cube's edges.\n\nSetting the scene\n\nI’m working through the steps to create a 3D wireframe cube, including setting the camera's position and orientation to view the cube from above at a 45-degree angle.\n\nAdjusting camera angle\n\nI’m refining the camera's position relative to the cube, ensuring it’s 45 degrees above the horizontal plane. This involves calculating the camera's position and direction, then determining the coordinate system for both.\n\nCalculating ray direction\n\nI’m working through raymarching by defining pixel ray direction and adjusting uv coordinates to accommodate the aspect ratio for each pixel.\n\nPiecing together camera details\n\nI’m gathering info on the camera's front, sides, and top, then crafting the rotation matrix for the cube based on time.\n\nThinking through rotation strategies\n\nI’m exploring two methods: rotating the point p in its space or applying the inverse rotation to the distance function. This consideration ensures precise distance function computations.\n\nCalculating rotational effects\n\nI’m working through a rotation function to apply inverse rotation to a point. This leads me to compute the distance function, accounting for a cube's edges.\n\nMapping cube construction\n\nI’m setting up a cube by identifying its vertices and edges, while noting that multidimensional arrays aren't supported in GLSL ES.\n\nRevisiting cubeEdges\n\nI’m mapping out an alternative structure for cubeEdges as a flat array, recognizing its potential impact on the distance function and considering the possibility of directly coding for the 12 edges.\n\nCalculating minimal distance\n\nI'm thinking about a function to compute the minimal distance from a point to a cube's edges, using arrays to represent vertices and edges. Handling GLSL's limitations is crucial.\n\nFormulating the approach\nI'm thinking through the problem of calculating the minimal distance from a point to a cube's edges without using arrays. By considering the cube as 12 edges along the x, y, or z axes, I aim to derive a direct distance function.\n\nThinking through distance measures\n\nI’m mapping out different methods to find the minimal distance to the edges of a cube, considering planes, the maximum of distances, modulus operations, and previous examples from IQ.\n\nEvaluating distance functions\n\nI'm considering IQ's function for box edges and wondering if I should implement or seek another approach due to its complexity.\n\nExamining distance functions\n\nI’m examining different ways to define the distance function for a wireframe cube, including intersections of planes and union of cube edges. Progressing through these options to determine the best approach.\n\nIdentifying axis-based proximity\n\nI’m thinking through how to pinpoint the closest distances to edges along each axis. This involves working with lines at specific positions where the other two coordinates are ±1.\n\nMapping axis lines\n\nI’m examining lines along the x, y, and z axes at coordinates ±1. This leads me to consider functions to determine minimum distance from a point to these lines.\n\nCalculating minimal distance\n\nI’m piecing together a function to compute the minimal distance from a point \n𝑝\np to lines along the x-axis at specific positions, iterating through different axis edges and using non-constant loop conditions, which isn't feasible in GLSL ES on Shadertoy.\n\nMapping out edge analysis\n\nThinking through unrolling loops for edges parallel to the coordinate axes, I’m listing positions along x, y, and z. This approach likely aids in computing minimal distances to these lines.\n\nDefining edge positions\n\nI'm setting up arrays for edge positions along the x, y, and z axes in GLSL ES. Each array is planned to store four 2D vectors, but GLSL ES's limitations might require a different approach.\n\nRevisiting edge calculations\n\nI’m noticing discrepancies in the edge positions of the cube. This leads me to revisit and verify each edge to ensure their coordinates align accurately with their respective axis and position.\n\nConfirming edge positions\n\nI’m piecing together the edge positions along the x-axis at y = ±1, z = ±1. Adjusting the point \n𝑝\np involves subtracting shifting vectors to pinpoint the precise coordinates for each edge.\n\nVacation week planning\n\nI'm piecing together the itinerary for a week-long vacation in France. Exploring activities and sights for a balanced mix of relaxation and adventure.\n\nRefining edge positions\n\nI noticed that the code for placing edges along the x-axis at y = 1 and z = 1 appears redundant. Is there a more efficient approach to refine these positions?\n\nAnalyzing computational methods\n\nThe text explores different strategies for defining a cube and calculating distances, considering modulus and raymarching primitives. Intriguing approaches to visualize and compute distances on the cube surface.\n\nCrafting the function\n\nI’m working through defining udBoxFrame to calculate the distance to a cube with edge thickness. It involves adjusting the point and computing distances to the box edges efficiently.\n\nRotating coordinates\n\nI’m mapping out the rotation function to adjust 3D coordinates around the Y-axis using sine and cosine functions. This helps rotate vector \n𝑝\np effectively.\n\nConstructing and refining\n\nOK, let me see. I’m mapping pixel coordinates, setting up the camera, and calculating ray direction. Then, I’m using raymarching to trace rays and compute the scene's lighting.\n\n*/\n\n\nvec3 rotateY(vec3 p, float angle)\n{\n    float s = sin(angle);\n    float c = cos(angle);\n    return vec3(\n        c * p.x + s * p.z,\n        p.y,\n        -s * p.x + c * p.z\n    );\n}\n\n\n\n\n/* GPT orig:\nfloat udBoxFrame(vec3 p, vec3 b, float e)\n{\n    p = abs(p)-b;\n    vec3 q = abs(p+e)-e;\n    float k = min(max(p.x,max(q.y,q.z)),0.0);\n    float da = length(max(vec3(p.x,q.y,q.z),0.0)) + k;\n    k = min(max(q.x,max(p.y,q.z)),0.0);\n    float db = length(max(vec3(q.x,p.y,q.z),0.0)) + k;\n    k = min(max(q.x,max(q.y,p.z)),0.0);\n    float dc = length(max(vec3(q.x,q.y,p.z),0.0)) + k;\n    return min(min(da, db), dc);\n}\n\nshadertoyjiang, 2024-09-19\nA simpler one:   */\nfloat udBoxFrame(vec3 p,vec3 b,float e)\n{\n    vec3 a = abs(p)\n       , m = 1. - step(a, a.yzx) * step(a, a.zxy);\n    return length(max(abs(a - b) - e, 0.) * m);\n}\n\n\nfloat map(vec3 p)\n{\n    // Rotate the point to make the cube rotate\n    float angle = iTime * 0.2;\n    p = rotateY(p, -angle);\n    \n    // Cube parameters\n    vec3 b = vec3(1.0); // Half-size of the cube\n    float e = 0.02;     // Edge thickness\n    return udBoxFrame(p, b, e);\n}\n\nvec3 calcNormal(vec3 p)\n{\n    float eps = 0.001;\n    vec2 e = vec2(1.0, -1.0) * eps;\n    return normalize(\n        e.xyy * map(p + e.xyy) +\n        e.yyx * map(p + e.yyx) +\n        e.yxy * map(p + e.yxy) +\n        e.xxx * map(p + e.xxx)\n    );\n}\n\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n    // Normalize pixel coordinates (from -1 to 1)\n    vec2 uv = (fragCoord.xy / iResolution.xy) * 2.0 - 1.0;\n    uv.x *= iResolution.x / iResolution.y;\n    \n    // Camera setup\n    vec3 camPos = vec3(0.0, 2.0, -2.0);\n    vec3 camTarget = vec3(0.0, 0.0, 0.0);\n    vec3 camUp = vec3(0.0, 1.0, 0.0);\n    \n    // Camera coordinate system\n    vec3 camForward = normalize(camTarget - camPos);\n    vec3 camRight = normalize(cross(camForward, camUp));\n    vec3 camUpActual = cross(camRight, camForward);\n    \n    // Ray direction\n    vec3 rayDir = normalize(camForward + uv.x * camRight + uv.y * camUpActual);\n    \n    // Ray marching parameters\n    float t = 0.0;\n    float maxDistance = 20.0;\n    int maxSteps = 100;\n    float minDistance = 0.001;\n    float d = 0.0;\n    vec3 p;\n    int i;\n    for (i = 0; i < maxSteps; i++)\n    {\n        p = camPos + t * rayDir;\n        d = map(p);\n        if (d < minDistance)\n            break;\n        t += d;\n        if (t >= maxDistance)\n            break;\n    }\n    if (t >= maxDistance)\n    {\n        fragColor = vec4(0.0);\n    }\n    else\n    {\n        // Compute normal\n        vec3 normal = calcNormal(p);\n        \n        // Simple shading\n        vec3 lightDir = normalize(vec3(0.5, 1.0, -0.5));\n        float diff = clamp(dot(normal, lightDir), 0.0, 1.0);\n        \n        fragColor = vec4(vec3(diff), 1.0);\n    }\n}\n\n",
                "description": "",
                "inputs": [],
                "name": "Image",
                "outputs": [
                    {
                        "channel": 0,
                        "id": 37
                    }
                ],
                "type": "image"
            }
        ],
        "ver": "0.1"
    }
}