{
    "Shader": {
        "info": {
            "date": "1594651656",
            "description": "A hyperbolic Poincare double sided Truchet weave that draws inspiration from Escher's Snake print and Mattz's \"Hyperbolic Truchet tiles\" example.",
            "flags": 0,
            "hasliked": 0,
            "id": "tljyRR",
            "likes": 130,
            "name": "Hyperbolic Poincare Weave",
            "published": 3,
            "tags": [
                "escher",
                "truchet",
                "geometry",
                "tile",
                "art",
                "hyperbolic",
                "poincare",
                "weave"
            ],
            "usePreview": 0,
            "username": "Shane",
            "viewed": 2364
        },
        "renderpass": [
            {
                "code": "/*\n\n\tHyperbolic Poincare Weave\n\t-------------------------\n\n\n\tThis is a double sided Truchet weaved hyperbolic polygonal tiling of the \n    Poincare disc... which sounds more complex than it actually is, since it's \n    nothing more than an amalgamation of procedures that you'll find all over \n    Shadertoy.\n\n    The imagery itself draws minor inspiration from M. C. Escher's Snake print, \n    and was rendered in a graphic ink style.\n\n\tI've always admired Matt's \"Hyperbolic Truchet\" example, and have wanted\n\tto put my own version together for a while, but I knew it'd involve some\n\tcareful forethought, so put it aside until I was feeling energetic. However, \n    since that was never going to happen, I decided to fumble my through an\n    example anyway. :D\n\n\tIn regard to the Poincare disc side of things, it was helpful to reference\n\tMLA, SL2C and STB's examples -- All authors have really nice work on here,\n\twhich is well worth the look. STB's \"Hyperbolic Poincaré transformed\"\n\tworkings were more reminiscent of my own method (but nicer), so I adopted \n    his calculations for the initialization function.\n\n\tDouble sided Truchet patterns were BigWings's idea some time back... Others\n    may have done it, but none were advertising. :) Anyway,\tthey've been covered \n    before by both myself and others, if you wish to learn about that particular \n    aspect of this example.\n\n    Poincare disc tiling and hyperbolic transformations have also been covered \n    everywhere, so there are plenty of examples on the net and on Shadertoy \n    regarding that aspect as well. Having said that, I'm hoping I've provided \n    enough of an explanation here to give people a start.\n\n \tThere's not as much code here as you'd think. Especially for the Poincare \n\tdisc setup. However, the example is a little long winded, so I'll put up a\n\tvery basic example without the weave within the next day or two to give \n\tpeople something easier to consume.\n\n    The last thing I'll mention is that Poincare disc tiling is relatively\n\trudimentary in the grand scheme of things. However, this is not my area of\n\texpertise, so don't look into anything I've written too deeply. In fact, if\n\tyou happen to be one of the experts on Shadertoy, and you spot anything that \n    doesn't seem right, feel free to let me know.\n\t\n\n\n\n    Poincare disc examples:\n\n    // The hyperbolic transformation itself is based on STB's example here,\n    // which I was informed was based on the following:\n    //\n    // Conformal Models of the Hyperbolic Geometry - Vladimir Bulatov \n    // http://www.bulatov.org/math/1001/index.html\n    //\n    // The Hyperbolic Chamber - Jos Leys\n    // http://www.josleys.com/article_show.php?id=83\n\t//\n    Hyperbolic Poincaré transformed - stb\n\thttps://www.shadertoy.com/view/3lscDf\n\n    // A beautiful example, and my reason for wanting to make one of these.\n    //\n\tHyperbolic Truchet tiles  - mattz \n    https://www.shadertoy.com/view/3llXR4\n\n\t// Like everyone else, I love the following example. However, be warned that \n    // it involves complex geometry. :)  Seriously though, Mattz can come up with \n    // solutions to problems in a few minutes that have utterly confounded me for \n    // weeks.\n    //\n\tHyperbolic Wythoff explorer - mattz \n\thttps://www.shadertoy.com/view/wtj3Ry\n\n*/\n\n\n// Regular pentagon tiling, which wouldn't work on the Euclidian plane, but\n// works just fine within the Poincare disc.\n//#define PENTAGON\n\n// Moving to the half plane model. It's a very simple transformation, so I\n// figured I may as well include it.\n//#define HALF_PLANE\n\n\n#define PI\t\t3.14159265\n#define TAU\t    6.28318531\n\n// Standard 2D rotation formula.\nmat2 rot2(in float a){ float c = cos(a), s = sin(a); return mat2(c, -s, s, c); }\n\n/*\n// GPU based random function.\nfloat hash21(vec2 p){  \n\n    // IQ's vec2 to float hash.\n    return fract(sin(dot(p, vec2(127.619, 57.583)))*43758.5453); \n    \n    \n    // Attempting to fix accuracy problems on some systems by using\n    // a slight variation on Dave Hoskin's hash formula, here:\n    // https://www.shadertoy.com/view/4djSRW\n    //vec3 p3 = fract(vec3(p.xyx)*.1031);\n    //p3 += dot(p3, p3.yzx + 43.1723);\n    //return fract((p3.x + p3.y)*p3.z);\n    \n}\n*/\n\n// Fabrice's fork of \"Integer Hash - III\" by IQ: https://shadertoy.com/view/4tXyWN\nfloat hash21(vec2 f){\n\n    uvec2 p = floatBitsToUint(f);\n    p = 1664525U*(p>>1U^p.yx);\n    return float(1103515245U*(p.x^(p.y>>3U)))/float(0xffffffffU);\n}\n\nvoid swap(inout int a, inout int b){ int tmp = a; a = b; b = tmp; }\n// A swap without the extra declaration -- It works fine on my machine, but I'm\n// not game  enough to use it, yet. :)\n//void swap(inout int a, inout int b){ a = a + b; b = a - b; a = a - b; }\n\n \n// Very handy. I rearranged it a bit, but it's the same function.\n//\n// Smooth Floor - Anastadunbar \n// https://www.shadertoy.com/view/lljSRV\nfloat floorSm(float x, float c) {\n    \n    float ix = floor(x); x -= ix;\n    return (pow(x, c) - pow(1.- x, c))/2. + ix;\n}\n\n\n// Poincare disc setup. Less work than you thiink is necessary.\n\n// N represents the number of polygon vertices, and Q is the number of \n// adjacent polygons to each vertex within the Poincare disc.\n//\n// For tilings to work, the following must be true: (P − 2)*(Q − 2)>4.\n//\n// For instance, 3 and 7 will work, but 4 and 4 will not.\n//\n// 3-7, 3-8, 4-5, 5-4, 6-4, 7-3.\n//\n// The further caveat with this particular example is that Q must be even\n// for the weave pattern to work... Why is a bit of a mystery to me. I'll \n// need to think about it, or wait for someone to explain. :)\n//\n#ifdef PENTAGON\nconst int N = 5;\t// Polygon vertices.\nconst int Q\t= 4;\t// Polygons meeting at a vertex.\n#else\nconst int N = 3;\t// Polygon vertices.\nconst int Q\t= 8;\t// Polygons meeting at a vertex.\n#endif\n\n\nfloat count; // Circle inversion count variable. \n\n// Calculating the initial circular domain according to number of polygon\n// sides (N) and the number of adjacent polygons (Q): STB was clever enough to  \n// use repeat polar space to position the rest. Anyway, the idea is to use the\n// polygon geometry to set up the required geometrical diagram (see the line \n// below), then use a mixture of standard Euclidean and hyperbolic geometry (if\n// needed) to calculate the required values, which are described below.\n// \nvec3 initDomain(){\n    \n    // There are quite a few ways to calculate the initial circular domain \n    // values, simply because there are several solutions to the same geometric \n    // problems, which is all this is. In fact, as geometric situations go,\n    // this is not a particularly difficult one to solve.\n    \n    // Essentially, you're going to be reflecting points about polygonal edges, \n    // so you'll need the distance from your initial circle center to that of \n    // the center of the circle that runs adjacent to the current domain edges in\n    // order to perform a hyperbolic reflection. You'll need the radius of that \n    // circle as well. The distance and radius will depend directly upon how\n    // how many edges your polygon has and how many adjacent polygons (the\n    // number that meet at a vertex point) there are.\n\n    // The following is some highschool level circle and triangle geometry to \n    // get the values we're after. Of course, none of this will mean much without \n    // some imagery to refer to. I find the diagrams on the following page more \n    // helpful than most: http://www.malinc.se/noneuclidean/en/poincaretiling.php\n    //\n     \n    /*\n    float alpha = PI/float(Q);\n    float beta = PI/float(N);\n    float gamma = PI/2. - alpha;\n    \n    // I've left these in this form in order to help follow the logic in the\n    // diagram that I've linked to above (about half way down the page). However,\n    // converting to cos and sin, etc, would be better.\n    float a = tan(gamma);\n    float b = tan(beta);\n\n    // Initial polygon radius.\n\tfloat polyRad = sqrt((a - b)/(a + b));\n\n    //float OP = (d + 1./d)/2.; \n    //float OM = OP/cos(beta);\n    float centDist = (polyRad + 1./polyRad)/2./cos(beta); // OM, on the diagram link above.\n    float circRad = ((-polyRad + 1./polyRad)/2.)/cos(gamma); // AM, on the diagram.\n    \n    return vec3(centDist, circRad, polyRad);\n    */\n    \n    \n    // Shadertoy user, SLB, uses the following, which does the exact same\n    // thing, but tackles the problem from a different perspective. It can\n    // be derived from the calculations above (which I was bored enough\n    // to confirm), and since I find them cleaner, I'm using them instead. By \n    // the way, the measurements given back will differ after a few decimal\n    // places, so will produce a slightly different random pattern, but \n    // it's essentially the same thing.\n    //\n    // As an addendum, SLB informed me that the calculations were based on \n    // the following informative article:\n    //\n    // The Hyperbolic Chamber - Jos Leys\n    // http://www.josleys.com/article_show.php?id=83\n   \n    float piDivN = PI/float(N), piDivQ = piDivN + PI/float(Q) - PI/2.;\n    \n    // Helper variables.\n\tvec2 trig1 = vec2(cos(piDivN), sin(piDivN));\n    vec2 trig2 = vec2(cos(piDivQ), sin(piDivQ));\n    \n    // Distance from the current circular domain center to the adjacent\n    // circle center, and the radius of that circle. These values will be \n    // the same for all polygons.\n    float dist = trig1.x - trig2.x*trig1.y/trig2.y;\n    float rad = length(vec2(dist, 0.) - trig1);\n    \n    float d = max(dist*dist - rad*rad, 0.);\n\n    // The last value is the distance from the current center to each\n    // vertex point... so the radius, I guess. It's used as a scaling \n    // component.\n\treturn vec3(dist, rad, 1)/sqrt(d);\n    \n    /*\n    // Shorter version, based off of the geometric diagram in the article above. \n\tfloat a = sin(PI/float(N)), b = cos(PI/float(Q));\n    float d2 = cos(PI/float(N) + PI/float(Q))/a;\n    float r2 = 1./(b*b/a/a - 1.);\n    return sqrt(max(vec3(1. + r2, r2, d2*d2*r2), 0.));    \n    */\n}\n\n\n// Hyperbolically reflecting the polygon across each of its edges\n// via an inverse Mobius transform. If you can't picture this fromt the \n// example imagery, looking at an image regarding polygon reflection in \n// a Poincare disc will make it clearer.\n//\n// By the way, if you want to get more of an intuitive feel for circle \n// inversion, I recommend Numberphile's \"Epic Circles\" video, here:\n// https://www.youtube.com/watch?v=sG_6nlMZ8f4\nvec2 transform(vec2 p, vec2 circ) {\n    \n    \n    // The following is a standard polar repeat operation. It works\n    // the same in hyperbolic space as it does in Euclidian space.\n    // If you didn't do this, you'd reflect across just the one\n    // edge. Set \"ia\" to \".5/float(N)\" to see what I mean.\n     \n    float ia = (floor(atan(p.x, p.y)/TAU*float(N)) + .5)/float(N);\n    // Start with a point on the boundary of the circle, then use \n    // polar repetition to put it on all the edge boundaries...\n    // right in the middle of the edge, which makes sense.\n    vec2 vert = rot2(ia*TAU)*vec2(0, circ.x);\n   \n    // The radius squared of the circle domain you're reflecting to. \n    float rSq = circ.y*circ.y;\n    \n    // Circle inversion, which relates back to an inverse Mobius\n    // transformation. There are a lot of topics on just this alone, but \n    // the bottom line is, if you perform this operation on a point within\n    // the Poincare disk, it will be reflected. It's similar to the\n    // \"p /= dot(p, p)\" move that some may have used before.\n    vec2 pc = p - vert;\n    float lSq = dot(pc, pc);\n    \n    // If the distance (we're squaring for speed) from the current\n    // point to any of the edge vertex points is within the limits, \n    // hyperbolically reflect it.\n    if(lSq<rSq){\n         \n        p = pc*rSq/lSq + vert;\n        \n        // Attempting to add some extra randomness. Normally,\n        // you wouldn't have this here.\n        p = rot2(TAU/float(N)*(count + float(Q)))*p;\n        \n        \n        // If we have a hit, increase the counter. This value can be useful\n        // for coloring, and other things.\n        count++; \n       \n    }\n     \n    return p;\n}\n\n\n// IQ's signed distance to a quadratic Bezier. Like all of IQ's code, it's\n// quick and reliable. :)\n//\n// Quadratic Bezier - 2D Distance - IQ\n// https://www.shadertoy.com/view/MlKcDD\nfloat sdBezier(vec2 pos, vec2 A, vec2 B, vec2 C){\n  \n    // p(t)    = (1 - t)^2*p0 + 2(1 - t)t*p1 + t^2*p2\n    // p'(t)   = 2*t*(p0 - 2*p1 + p2) + 2*(p1 - p0)\n    // p'(0)   = 2*(p1 - p0)\n    // p'(1)   = 2*(p2 - p1)\n    // p'(1/2) = 2*(p2 - p0)\n    \n    vec2 a = B - A;\n    vec2 b = A - 2.0*B + C;\n    vec2 c = a * 2.0;\n    vec2 d = A - pos;\n\n     // If I were to make one change to IQ's function, it'd be to cap off the value \n    // below, since I've noticed that the function will fail with straight lines.\n    float kk = 1./max(dot(b,b), 1e-6); // 1./dot(b,b);\n    float kx = kk * dot(a,b);\n    float ky = kk * (2.0*dot(a,a)+dot(d,b)) / 3.0;\n    float kz = kk * dot(d,a);      \n\n    float res = 0.0;\n\n    float p = ky - kx*kx;\n    float p3 = p*p*p;\n    float q = kx*(2.0*kx*kx - 3.0*ky) + kz;\n    float h = q*q + 4.0*p3;\n\n    if(h >= 0.0) \n    { \n        h = sqrt(h);\n        vec2 x = (vec2(h, -h) - q) / 2.0;\n        vec2 uv = sign(x)*pow(abs(x), vec2(1.0/3.0));\n        float t = uv.x + uv.y - kx;\n        t = clamp( t, 0.0, 1.0 );\n\n        // 1 root\n        vec2 qos = d + (c + b*t)*t;\n        res = length(qos);\n    }\n    else\n    {\n        float z = sqrt(-p);\n        float v = acos( q/(p*z*2.0) ) / 3.0;\n        float m = cos(v);\n        float n = sin(v)*1.732050808;\n        vec3 t = vec3(m + m, -n - m, n - m) * z - kx;\n        t = clamp( t, 0.0, 1.0 );\n\n        // 3 roots\n        vec2 qos = d + (c + b*t.x)*t.x;\n        float dis = dot(qos,qos);\n        \n        res = dis;\n\n        qos = d + (c + b*t.y)*t.y;\n        dis = dot(qos,qos);\n        res = min(res,dis);\n\n        qos = d + (c + b*t.z)*t.z;\n        dis = dot(qos,qos);\n        res = min(res,dis);\n\n        res = sqrt( res );\n    }\n    \n    return res;\n}\n\n// Rendering the smooth Bezier segment. The idea is to calculate the midpoint\n// between \"a.xy\" and \"b.xy,\" then offset it by the average of the combined normals\n// at \"a\" and \"b\" multiplied by a factor based on the length between \"a\" and \"b.\"\n// At that stage, render a Bezier from \"a\" to the midpoint, then from the midpoint\n// to \"b.\" I hacked away to come up with this, which means there'd have to be a more\n// robust method out there, so if anyone is familiar with one, I'd love to know.\nfloat doSeg(vec2 p, vec4 a, vec4 b, float r){\n    \n    // Mid way point.\n    vec2 mid = (a.xy + b.xy)/2.; // mix(a.xy, b.xy, .5);\n    \n    // The length between \"a.xy\" and \"b.xy,\" multiplied by... a number that seemed\n    // to work... Worst coding ever. :D\n    float l = length(b.xy - a.xy)*1.732/6.; // ;//(1.4142 - 1.)/1.4142;\n \n    // Points on the same edge each have the same normal, and segments between them\n    // require a larger arc. There was no science behind the decision. It's just \n    // something I noticed and hacked a solution for. Comment the line out, and you'll \n    // see why it's necessary. By the way, replacing this with a standard semicircular \n    // arc would be even better, but this is easier.\n    if(abs(length(b.zw - a.zw))<.01) l = r; \n  \n    // Offsetting the midpoint between the exit points \"a\" and \"b\"\n    // by the average of their normals and the line length factor.\n    mid += (a.zw + b.zw)/2.*l;\n\n    // Piece together two quadratic Beziers to form the smooth Bezier curve from the\n    // entry and exit points. The only reliable part of this method is the quadratic\n    // Bezier function, since IQ wrote it. :\n    float b1 = sdBezier(p, a.xy, a.xy + a.zw*l, mid);\n    float b2 = sdBezier(p, mid, b.xy + b.zw*l, b.xy);\n    \n    // Return the minimum distance to the smooth Bezier arc.\n    return min(b1, b2);\n}\n\n \n\n// Regular Polygon SDF - BasmanovDaniil\n// https://www.shadertoy.com/view/MtScRG\nfloat Polygon(vec2 p, float vertices, float radius){\n\n    float segmentAngle = TAU/vertices;\n     \n    float angleRadians = atan(p.x, p.y);\n    float repeat = mod(angleRadians, segmentAngle) - segmentAngle/2.;\n    float inradius = radius*cos(segmentAngle/2.);\n    float circle = length(p);\n    return cos(repeat)*circle - inradius;\n   \n}\n\n// Mouse pointer inversion.\nvec2 mouseInversion(vec2 p){\n    \n    // Mouse coordinates.\n    vec2 m = vec2((2.*iMouse.xy - iResolution.xy)/iResolution.y);\n    // Hack for the zero case instance. If someone has a better way,\n    // feel free to let me know.\n    if(length(m) < 1e-3) m += 1e-3; \n    // A hack to stop some craziness occurring on the border.\n    if(abs(m.x)>.98*.7071 || abs(m.y)>.98*.7071) m *= .98;\n    \n    // Taking the mouse point and inverting it into the circle domain.\n    // Feel free to check some figures, but all will get mapped to \n    // values that lie within circle radius.\n    float k = 1./dot(m, m);\n    vec2 invCtr = k*m; \n    float t = (k - 1.)/dot(p -invCtr, p - invCtr);\n    p = t*p + (1. - t)*invCtr;\n    p.x = -p.x; // Keep chirality. MLA does this. \n    \n    return p;\n    \n}\n\nvoid mainImage(out vec4 fragColor, in vec2 fragCoord){\n    \n    \n    // Aspect correct coordinates: Actually, fragCoord is already in \n    // aspect correct form, so shifting and scaling is all that is\n    // required in this particular pixel shader environment.\n    vec2 uv = (2.*fragCoord - iResolution.xy)/iResolution.y;\n  \n    \n    #ifdef HALF_PLANE\n    // Moving to the half plane model.\n    const float sc = 4.;\n    uv.y += sc/2. + 1.;\n    uv /= dot(uv, uv)/sc;\n    uv.y -= 1.; \n    #else   \n    // Contracting things just a touch to fit the Poincare domain on \n    // the canvas.\n    uv *= 1.05;\n    #endif\n      \n    // Poincare coordinates.\n    vec2 p = uv;\n \n\n\n    // A bit of mouse inversion and rotation to begin with. You'll\n    // see this a lot in various hyperbolic examples, and others.\n    p = mouseInversion(p);\n        \n    // Perform some free rotation.\n    p = rot2(iTime/16.)*p;\n    \n    \n    // Inversion count. It's used for all kinds of things, like \n    // random number production, etc.\n    count = 0.;\n\n    \n    // Filling in the domain origin information: From left to right, it \n    // returns the distance between adjacent polygon centers, the adjacent \n    // polygon radius, and the current polygon radius. These values remain\n    // the same for all polygons throughout the hyperbolic plane, so this \n    // is all that's required to tile the disc.\n    vec3 domInfo = initDomain();\n    \n \n    // Performing multiple reflective inversions to fill out the disk. Due \n    // to the nature of the hyperbolic transform, the polygon tiles get \n    // smaller as you approach the outer disk, and never reach the edge. \n    // There are a bunch of proofs in complex analysis that illustrate\n    // this, but nothing shows it as well as a computer program. :)\n    // Drop the number of iterations and you'll see the process unfold.\n    //\n    // One more important thing I should mention is that there's a test\n    // within the transform function (if you're outside the domain) that \n    // would allow you to break early, but I'm bypassing that for \n    // simplicity. The function is cheap, so I'm letting it run through, \n    // but when speed is an issue, it should be considered.\n    for(int i=0; i<24; i++){\n        p = transform(p, domInfo.xy);\n    }\n    \n    // Handling the imagery outside the Poincare circle domain by inverting or\n    // mirroring it back into the circle so that it shows up... or something\n    // to that effect... It's been a while. Either way, this is what you do\n    // if you want to see the outside pattern. :)\n    //\n    // By the way, if you want to get more of an intuitive feel for circle \n    // inversion, I recommend Numberphile's \"Epic Circles\" video, here:\n    // https://www.youtube.com/watch?v=sG_6nlMZ8f4\n    if(length(p)> 1.) p /= dot(p, p); \n    \n      \n    // This isn't absolutely necessary, but scaling the transformed coordinates\n    // by the disk radius brings things into the zero to one range, which saves\n    // a lot of headaches when plotting vertex points, and so forth.\n    p /= (domInfo.z);\n    \n    // Smoothing factor: You could never really get this right. Super sampling\n    // would be the best option, but the cheap alternative is kind of OK.\n    float sf = .015;\n    // Reduces sparkling at the ring edges... Experimental, for now. \n    //float rsf = (2. - smoothstep(0., .2, abs(length(uv) - 1.) - .2));\n    //float sf = 4./iResolution.y*rsf;//(count*count + 1.);//fwidth(shape);// \n\n      \n    // Rendering the polygon with a standard routine. I you were after pixel \n    // precise imagery, you'd need to take the overlapping circle point route,\n    // or take it a step further and carve out edge circles... At some stage, \n    // I'd like to put together an extruded version, in which case, I'd take\n    // the aforementioned into account, but for now, this will work fine. :)\n    //\n    // By the way, it's possible to account for the warping a bit by pinching \n    // the local coordinates slightly to match the warped hyperbolic space. \n    // It's possible to use a cheap hacky method (see below), rather than the \n    // more advanced method suggested. However, the best way is to use some\n    // CSG within the transform function. I'll do that when I put an extruded\n    // version together at a later stage.\n    //float shape = Polygon(p*(1. - dot(p, p)*domInfo.z/3.), float(N), .72); // Pinched.\n    float shape = Polygon(p, float(N), .8);\n\n \n    \n    // Lines and vertex points.\n    vec2 vp[N];\n    float ln[N]; \n    \n    // Offset mid points (sitting either side of the midpoint).\n    // Shuffle array. This will be used to shuffle rendering order.\n    const int N2 = N*2;\n    vec4 mp[N2];\n    int shuff[N2];\n    \n    float vert = 1e5;\n    vec2 v0 = vec2(0, 1);\n    \n    for(int i = 0; i<N; i++){\n        vert = min(vert, length(p - v0) - .09);//.25*domInfo.z\n        vp[i] = v0;        \n        v0 = rot2(TAU/float(N))*v0;\n    }\n    \n\n    // Producing some colored segments based on the angle of the \n    // local polygon cell coordinates.\n    vec2 rp = rot2(float(count + 2.)*TAU/float(N))*(p);\n    float angl = mod(atan(rp.x, rp.y), TAU)*float(N2)/TAU;\n    float triSeg = (floorSm(angl, .1) + .5)/float(N2);\n    vec3 oCol = .55 + .45*cos(triSeg*TAU + vec3(0, 1, 2));\n    // Fire palette option... Interesting, but I'm giving it a down vote. :D\n    //vec3 oCol = pow(vec3(1.5, 1, 1)*max(triSeg, 0.), vec3(1, 3, 16));\n\n    // Debug coloring to test out various color combinations.\n    //oCol = vec3(1.2, .8, .5).xzy*(mod(count, float(N)) + 1.)/(float(N) + 1.); \n    //if(mod(float(count), 4.)>1.5) oCol *= vec3(1.2, 1.5, 1);\n    \n    \n    // Coloring up the canvas. All this was added in on the fly. Once you have\n    // access to the local coordinates and vertice information, you do\n    // whatever you want.\n    \n    // Background.\n    vec3 col = vec3(1, .99, .98);\n    \n    // The polygon. The default is a triangle, but others will work too.\n    col = mix(col, vec3(0), 1. - smoothstep(0., sf, shape));\n    col = mix(col, oCol, 1. - smoothstep(0., sf, shape + .04));//.35*f*f\n\n    // Vertices.\n    col = mix(col, vec3(0), 1. - smoothstep(0., sf, vert));\n    //col = mix(col, vec3(0), (1. - smoothstep(0., sf, abs(length(p) - 1.) - .09)));\n    \n \n\n    // Polygon side length. Even though they look like different lengths,\n    // they're hyperbolically the same.\n    float sLength = length(vp[0] - vp[1]);\n    \n    \n    for(int i = 0; i<N; i++){ \n        \n        // Initializing the shuffle array while we're here\n        shuff[i*2] = i*2;\n        shuff[i*2 + 1] = i*2 + 1;\n        \n        // Constructing the two points on either side of the midpoint and\n        // the respective normals to act as entry and exit points for\n        // the Bezier curves.\n        vec2 mpi = mix(vp[i], vp[(i + 1)%N], .5);\n        vec2 tangenti = normalize(mpi - vp[i]);\n        //\n        // The neat formulae above is how you'd calculate mid points in Euclidean \n        // geometry, whereas in this case, you have to calculate the mid point by rotating\n        // the vertex point to the mid point position, then using a known  center to mid \n        // point distance (neighbor to neighbor center to center minus initial radius)... \n        // However, I need to calculate proper edge tangents... I'll leave the\n        // approximations above, for now. :)\n        //vec2 mpi = (rot2(PI/float(N))*vp[i]/domInfo.z)*(domInfo.x - domInfo.y);\n        //vec2 tangenti = normalize(mpi.yx*vec2(1, -1));\n        \n        // Points flanking either side of the mid point above.\n        mp[i*2].xy = mpi - tangenti*sLength/6.;\n        mp[i*2 + 1].xy = mpi + tangenti*sLength/6.;\n        \n        // Respective normals, which are fed into a Bezier line curve formula. That thing\n        // is compicated as well, but thankfully, IQ calculated that. :)\n        mp[i*2].zw = tangenti.yx*vec2(1, -1);\n        mp[i*2 + 1].zw = tangenti.yx*vec2(1, -1);\n    \n    } \n    \n    \n    // Shuffling the variable array of points and normals -- Six is the maximum. I think \n    // this is the Fisher–Yates method, but don't quote me on it. It's been a while since \n    // I've used a shuffling algorithm, so if there are inconsistancies, etc, feel free to \n    // let me know.\n    //\n    // For various combinatorial reasons, some non overlapping tiles will probably be \n    // rendered more often, but generally speaking, the following should suffice.\n    //\n    //int index = N;\n    for(int i = N2 - 1; i>0; i--){\n        \n        // For less than three edges, skip the upper array positions.\n        if(i >= N2) continue;\n        \n        // Using the cell ID and shuffle number to generate a unique random number.\n        float fi = float(i);\n        \n        // Random number for each triangle: The figure \"s*3 + ioffs + 1\" is unique for\n        // each triangle... I can't remember why I felt it necessary to divide by 3,\n        // but I'll leave it in there. :)\n        float rs = hash21(vec2(count) + domInfo.xy + domInfo.z + fi/float(N2));\n        \n        // Other array point we're swapping with.\n        //int j = int(floor(mod(rs*float(index)*1e6, fi + 1.)));\n        // I think this does something similar to the line above, but if not, let us know.\n        int j = int(floor(rs*(fi + .9999)));\n        swap(shuff[i], shuff[j]);\n        \n        //swap(mp[i], mp[j]);\n        \n    }  \n     \n    \n    for(int i = 0; i<N; i++){   \n        \n        // Shuffled indices.\n        int j = shuff[i*2], jp1 = shuff[i*2 + 1];\n        \n        // Constructing each of the Bezier line segments. Each is\n        // rendered from one random entry point to a random exit.\n        // It's covered more thoroughly in my other examples, if\n        // you're interested in the process.\n        // \n        // Offset mid points, and their normal directions.\n        float lnOff = sLength/4.; // Quarter side length.\n        ln[i] = doSeg(p, mp[j], mp[jp1], lnOff) - .105;\n        \n        // Interwoven rings.\n        // Technically, you need a proper arc formula (which you can find in my \n        // other Truchet examples), but this will illustrate the general idea.\n        //ln[i] = abs(length(p - vp[i]) - sLength/1.75) - lw;\n    \n    }\n    \n    \n    // Fine shape lines. They need to be faded out near the outer ring edges.\n    // Hence, the esoteric ring blending add in.\n    float ringBlend = smoothstep(0., .235, abs(length(uv) - 1.) - .1);\n    float pat2 = abs(fract(shape*16.) - .5)*2. - .05; // Concentric dark lines.\n    col = mix(col, vec3(0), ringBlend*(1. - smoothstep(0., .5, pat2))*.7);\n    \n     for(int i = 0; i<N; i++){\n         \n         // Rendering the Bezier curves. There's a drop shadow, stroke,\n         // colored layer, and fine inner lines. All standard layering stuff.\n         \n         // Line pattern.\n         pat2 = abs(fract(ln[i]*16. + .5) - .5)*2. - .05;\n         pat2 = mix(1., 0., ringBlend*(1. - smoothstep(0., .5, pat2))*.7);\n         \n         // Bezier distance field layers.\n         vec3 bgC = col;\n         col = mix(col, vec3(0), (1. - smoothstep(0., sf*5., ln[i]))*.3);\n         col = mix(col, vec3(0), 1. - smoothstep(0., sf, ln[i]));\n         col = mix(col, mix(bgC*1.2, vec3(1, .97, .26), .85)*pat2, \n                   1. - smoothstep(0., sf, ln[i] + .04));\n         col = mix(col, col*1.3, 1. - smoothstep(0., sf, ln[i] + .085));\n         \n    }\n\n    \n    // Rendering an outer ring with fake shadwo and all that. Poincare disks can \n    // get pretty busy visually on the outer edges, so I figured this was a kind\n    // of artsy way to deal with it. There are others.\n    //float lu2 = length(uv - vec2(.3));\n    \n    // Rotate the coordinates, construct a right, and put a dial pattern on it.\n    uv*= rot2(iTime/16.);\n    float lu = length(uv); // Circle.\n    float ring = abs(lu - 1.) - .05; // Ring distance field.\n    \n    // Dial pattern.\n    float ang = atan(uv.x, uv.y)/TAU;\n    float pat = abs(fract(ang*72.) - .5)*2.;\n    pat = smoothstep(0., sf, pat - .125);\n    \n\n    // Rendering the drop shadow, etc.\n   \n    col = mix(col, vec3(0), (1. - smoothstep(0., sf*5., ring-.01))*.6);\n    col = mix(col, vec3(0), (1. - smoothstep(0., sf/2., ring)));\n\n    col = mix(col, vec3(1, .99, .98)*pat*.35 + .65, 1. - smoothstep(0., .005, ring + .02));\n    ring = max(ring + .02, lu - .995);\n    col = mix(col, vec3(.4)*pat, (1. - smoothstep(0., sf/3., ring)));\n   \n    \n    // Black and white imagery outside the ring to give it more of an ink art kind of feel.\n    col = mix(col, min( mix(col, vec3(1)*dot(col, vec3(.299, .587, .114)), \n                   min(lu*.7, 1.))*1.15, 1.),  1. - smoothstep(0., sf, 1.05 - lu));\n    \n    /*\n    // Subtle light... I wasn't feeling it. I was going to put in the whole refracted dome \n    // thing, but took the less is more option.\n    float spe = max(1. - lu2*lu2*2., 0.);\n    col = mix(col, col + pow(spe, 6.)*.05 + pow(spe, 16.)*.3, \n                   1. - smoothstep(0., sf, lu2 - .6));\n    col = mix(col, col + lu2*lu2, 1. - smoothstep(0., sf, lu2 - .25));\n    */\n    \n    fragColor = vec4(sqrt(max(col, 0.)), 1.);\n}\n",
                "description": "",
                "inputs": [],
                "name": "Image",
                "outputs": [
                    {
                        "channel": 0,
                        "id": 37
                    }
                ],
                "type": "image"
            }
        ],
        "ver": "0.1"
    }
}